# Aerial.
cask 'aerial'

# Bash.
brew 'bash'
brew 'bash-completion'
brew 'shellcheck'

# Battery.
tap 'Goles/battery'
brew 'battery'

# Bazel.
tap 'bazelbuild/tap'
brew 'bazel'

# Ctags.
brew 'ctags-exuberant'

# Docker.
brew 'docker'

# Fuck.
brew 'thefuck'

# Git.
brew 'diff-so-fancy'
brew 'gist'
brew 'git'
brew 'hub'
brew 'icdiff'
brew 'tig'

# Golang.
brew 'glide'
brew 'go'

# Htop.
brew 'htop'

# Jq.
brew 'jq'

# Linux.
brew 'coreutils'
brew 'pstree'

# MTR.
brew 'mtr'

# Neovim.
tap 'neovim/homebrew-neovim'
brew 'neovim'

# Node.
brew 'node'

# PDF.
cask 'wkhtmltopdf'

# Pyenv.
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'

# Rbenv.
brew 'rbenv'

# Ripgrep.
brew 'ripgrep'

# terminal-notifier
brew 'terminal-notifier'

# Tmux.
brew 'tmux'
brew 'reattach-to-user-namespace'

# Tree.
brew 'tree'

# Urlview.
brew 'urlview'

# Watch.
brew 'watch'
