tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
brew 'cmake'
brew 'xz'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'diff-so-fancy'
brew 'pcre'
brew 'git'
brew 'go'
brew 'docker'
brew 'gdbm'
brew 'htop'
brew 'hub'
brew 'oniguruma'
brew 'jq'
brew 'openssl'
brew 'libevent'
brew 'libyaml'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'macvim', args: ['with-override-system-vim']
brew 'mercurial'
brew 'neovim'
brew 'mongodb'
brew 'node'
brew 'postgresql'
brew 'reattach-to-user-namespace'
brew 'zeromq'
brew 'saltstack'
brew 'shellcheck'
brew 'sleepwatcher'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'urlview'
brew 'watch'
brew 'caskroom/cask/brew-cask'
brew 'homebrew/versions/swig304'
cask 'ngrok'
