# Aerial.
cask 'aerial'

# Bash.
brew 'bash'
brew 'bash-completion'
brew 'shellcheck'

# Bat.
brew 'bat'

# Battery.
tap 'Goles/battery'
brew 'battery'

# Bazel.
tap 'bazelbuild/tap'
brew 'bazel'

# Ctags.
brew 'ctags-exuberant'

# Docker.
brew 'docker'

# ERD (Haskell).
brew 'graphviz', args: ['with-pango']
brew 'ghc'
brew 'cabal-install'
# Finish with:
# $ cabal install --allow-newer erd
# $ ln -s ~/.cabal/bin/erd /usr/local/bin/

# Fonts.
tap 'caskroom/fonts'
cask 'font-source-code-pro'

# fswatch.
brew 'fswatch'

# Fuck.
brew 'thefuck'

# Git.
brew 'diff-so-fancy'
brew 'gist'
brew 'git'
brew 'hub'
brew 'icdiff'
brew 'tig'

# Golang.
brew 'glide'
brew 'go'

# GSL.
brew 'gsl'

# Htop.
brew 'htop'

# Javascript.
brew 'nodenv'

# Jq.
brew 'jq'
brew 'python-yq'

# Linux.
brew 'coreutils'
brew 'pstree'

# Mosh.
brew 'mosh'

# MTR.
brew 'mtr'

# Nailgun.
brew 'nailgun'

# Neovim.
tap 'neovim/homebrew-neovim'
brew 'neovim', args: ['HEAD']

# PDF.
cask 'wkhtmltopdf'

# Pyenv.
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'

# Rbenv.
brew 'rbenv'

# Ripgrep.
brew 'ripgrep'

# Scala.
brew 'scala@2.11', args: ['with-docs', 'with-src']
brew 'olafurpg/scalafmt/coursier', args: ['HEAD']
brew 'olafurpg/scalafmt/scalafmt', args: ['HEAD']

# sed.
brew 'gnu-sed', args: ['with-default-names']

# terminal-notifier
brew 'terminal-notifier'

# Terraform.
brew 'terraform'
tap 'wata727/tflint'
brew 'tflint'

# Tmux.
brew 'tmux'
brew 'reattach-to-user-namespace'

# Tree.
brew 'tree'

# Urlview.
brew 'urlview'

# Watch.
brew 'watch'
